[
  {
    "postId": 1,
    "id": 1,
    "name": "JenniferAK",
    "email": "Eliseo@gardner.biz",
    "body": "Crap...as a standalone name I meant John, not Jon. Sorry!"
  },
  {
    "postId": 1,
    "id": 2,
    "name": "GoodbyeToby",
    "email": "Jayne_Kuhic@sydney.com",
    "body": "I always think it's Jon when named Jonathan and John when named just John. I could be completely wrong though, it's just how I know them as."
  },
  {
    "postId": 1,
    "id": 3,
    "name": "junebug69",
    "email": "Nikita@garfield.biz",
    "body": "John is the proper spelling for the official name. Jon, imo, is th nickname for Jonathan. John by far"
  },
  {
    "postId": 1,
    "id": 4,
    "name": "JellyBellyJump",
    "email": "Lew@alysha.tv",
    "body": "I prefer Jon, but I'm biased, it's my dad's name! I agree with other posters, pick the spelling based on who your naming the baby after. I have nearly the same example: my husband has a Uncle John that's passed away and my father has passed away. But our son's middle name is spelled Jon because he's named after my father."
  },
  {
    "postId": 1,
    "id": 5,
    "name": "StSimcoe",
    "email": "Hayden@althea.biz",
    "body": "I agree with you. Either Jonathan or John."
  },
  {
    "postId": 2,
    "id": 6,
    "name": "Skilocat",
    "email": "Presley.Mueller@myrl.com",
    "body": "My son's middle name is after his grandfather Ronald. But 'Ronald' never went by that name, he was always called Ronnie. So LO's middle name is just that - Ronnie.\nSo my vote is Jon :) I feel like it adds a super personal touch and deeper meaning to Everett's name."
  },
  {
    "postId": 2,
    "id": 7,
    "name": "danceswithdiapers",
    "email": "Dallas@ole.me",
    "body": "I agree with meg. I think with the spelling John you can say it honors both sides. definitely how would spell it. good luck."
  },
  {
    "postId": 2,
    "id": 8,
    "name": "nikkidubai",
    "email": "Mallory_Kunze@marie.org",
    "body": "Agree john is a full name but Jon is a nn for Jonathan. But honestly either way you are fine to tell them all you've named the baby Jon/john after them. Is there a reason naming baby after brother? It's usually grandparents so I would sway that way (plus John is better) unless your husband has a strong reason to be after his brother."
  },
  {
    "postId": 2,
    "id": 9,
    "name": "babyk-o",
    "email": "Meghan_Littel@rene.us",
    "body": "Thanks for all of your help. Still not 100% sure what I'm going to do. Is Jon a legit spelling or is it a nickname/short form for Jonathan? Thank you!"
  },
  {
    "postId": 2,
    "id": 10,
    "name": "jennymom070",
    "email": "Carmen_Keeling@caroline.name",
    "body": "John"
  },
  {
    "postId": 3,
    "id": 11,
    "name": "GirlMom1234",
    "email": "Veronica_Goodwin@timmothy.net",
    "body": "John. Jon is a nickname, as you mentioned."
  }
]